<?php
//задание1
$arr=['a'=>11, 'b'=>20, 'c'=>30];
echo $arr['c']."\n";
echo $arr['a']+$arr['b']+$arr['c'];
//задание2
$arr=['q3'=>12, 'r3'=>23, 'f3'=>34];
echo array_sum($arr);
//задание3
$arr = ['Коля'=>'1000$', 'Вася'=>'500$', 'Петя'=>'200$'];
echo $arr['Коля']."\n".$arr['Петя'];
//задание4
$m=['1'=>'январь','2'=>'февраль','3'=>'март','4'=>'апрель','5'=>'май','6'=>'июнь','7'=>'июль','8'=>'август','9'=>'сентябрь','10'=>'октябрь','11'=>'ноябрь','12'=>'декабрь'];
echo $m['9'].' и '.$m['6'];
//задание5
$n=[1=>'понедельник',2=>'втроник',3=>'среда',4=>'четверг',5=>'пятница',6=>'суббота',7=>'воскресенье'];
$day=3;
echo $n[$day];
?>

